Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
/*
 * ============================================
 * ESP32 R32 - Cool Breeze Nexus Integration
 * Production HVAC Monitoring System - OPTIMIZED
 * ============================================
 * 
 * VERSION: 2.2.0-OPTIMIZED (Improved Reliability)
 * COMPATIBILITY: ESP32 Arduino Core 2.0.11 - 3.0.x
 * 
 * OPTIMIZATIONS:
 * - Data transmission: Every 2 minutes (120 seconds) instead of 60 seconds
 * - Reduced bandwidth usage by 50%
 * - Reduced edge function calls by 50%
 * - Lower power consumption
 * - Rate limiting support on server side
 * 
 * IMPROVEMENTS:
 * - Watchdog timer (60s) to prevent stalls
 * - Boot button hold (5s) to enter config mode
 * - WiFi stuck detection and auto-recovery
 * - Improved HTTP POST timeout handling
 * - Auto reset every 6 hours (improved from 24h)
 * - No automatic WiFi reset on connection failure (prevents reset if WiFi down for days)
 * 
 * FEATURES:
 * - WiFiManager for easy WiFi configuration
 * - Supabase HTTP POST integration (Dashboard Compatible)
 * - WiFi/ADC conflict resolution (WiFi OFF during sensor reading)
 * - 1-minute averaged sensor readings
 * - Timeout mechanisms for slow/failed connections
 * - Automatic 6-month full reset (memory leak prevention)
 * - Auto reset every 6 hours (improved reliability)
 * - Watchdog timer (60s) to prevent stalls
 * - Boot button hold (5s) to enter config mode
 * - WiFi stuck detection and auto-recovery
 * - RTC memory for persistent uptime tracking
 * - Smart status detection (good/warning/error)
 * 
 * TIMING:
 * - Sensor readings: Every 1 second (WiFi OFF)
 * - Data transmission: Every 120 seconds (2 minutes) - OPTIMIZED
 * - WiFi timeout: 30 seconds for connection
 * - HTTP timeout: 10 seconds for POST
 * - Max WiFi on time: 60 seconds (safety net)
 * - Auto reset: Every 6 hours (improved from 24h)
 * - Watchdog timeout: 60 seconds
 * - Boot button hold: 5 seconds to enter config
 * 
 * CHANGES FROM V2.1.0:
 * - Optimized to 2-minute data transmission
 * - Added watchdog timer
 * - Added boot button config mode
 * - Improved WiFi handling (no auto-reset on failure)
 * - Removed old reset button method
 * - More frequent auto-reset (6 hours)
 * 
 * ============================================
 */

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <esp_task_wdt.h>
#include <EmonLib.h>
#include <esp_adc_cal.h>
#include <time.h>
#include <esp_system.h>
#include <ArduinoJson.h>

// ============================================
// DEBUG MODE - Set to 1 for detailed sensor output
// ============================================
#define DEBUG_MODE 1  // Change to 0 to disable debug output

// ============================================
// DEVICE CONFIGURATION
// ============================================
const String DEVICE_ID = "R32";
const String FIRMWARE_VERSION = "2.2.0-OPTIMIZED";

// ============================================
// TIMING CONSTANTS - OPTIMIZED FOR 2-MINUTE UPDATES
// ============================================
const unsigned long SENSOR_READ_INTERVAL = 1000;        // 1 second
const unsigned long DATA_SEND_INTERVAL = 120000;         // 120 seconds (2 minutes) - OPTIMIZED
const unsigned long WIFI_CONNECT_TIMEOUT = 30000;        // 30 seconds
const unsigned long HTTP_POST_TIMEOUT = 10000;            // 10 seconds (optimized)
const unsigned long MAX_WIFI_ON_TIME = 60000;             // 1 minute (safety net, reduced)
const unsigned long AUTO_RESET_INTERVAL = 21600000;      // 6 hours (improved from 24h for better reliability)
const unsigned long SIX_MONTH_RESET = 15552000000ULL;    // 180 days in milliseconds
const unsigned long BOOT_BUTTON_HOLD_TIME = 5000;        // 5 seconds to enter config mode
const unsigned long WATCHDOG_TIMEOUT = 60;               // 60 seconds watchdog timeout
const unsigned long WIFI_STUCK_TIMEOUT = 120000;         // 2 minutes - if WiFi stuck, force reset

// ============================================
// Pin Definitions
// ============================================
const int TEMP_PIN_MOTOR = 21;
const int TEMP_PIN_EXTERIOR = 22;
const int TEMP_PIN_INTERIOR = 23;
const int CT_PIN = 36;
const int FLOAT_PIN = 5;
const int GPIO_YELLOW_EXHAUST = 34;
const int GPIO_GREEN_FAN = 35;
const int GPIO_BROWN_PUMP = 32;
const int GPIO_BLACK_DRAIN = 33;
const int BOOT_BUTTON_PIN = 0;  // ESP32 Dev Module boot button (GPIO 0)

// ============================================
// Temperature Sensor Setup
// ============================================
OneWire oneWireMotor(TEMP_PIN_MOTOR);
OneWire oneWireExterior(TEMP_PIN_EXTERIOR);
OneWire oneWireInterior(TEMP_PIN_INTERIOR);

DallasTemperature sensorMotor(&oneWireMotor);
DallasTemperature sensorExterior(&oneWireExterior);
DallasTemperature sensorInterior(&oneWireInterior);

// ============================================
// CT Sensor Configuration
// ============================================
EnergyMonitor emon1;
const float CALIBRATION = 16.5;
const float MIN_CURRENT_THRESHOLD = 1.0;
const float MAX_CURRENT_THRESHOLD = 16.0;
const float LINE_VOLTAGE = 230.0;
const float ADC_VREF = 3.3;

// ============================================
// Pickup ADC Configuration
// ============================================
const int ADC_SAMPLES = 100;
const int ADC_SAMPLE_DELAY_US = 150;
esp_adc_cal_characteristics_t adc_chars;

// Pickup voltage thresholds
const float VOLTAGE_DISCONNECTED_MAX = 0.5;
const float VOLTAGE_ON_MIN = 0.8;
const float VOLTAGE_ON_MAX = 2.632;
const float VOLTAGE_OFF_MIN = 2.807;

// Fan speed calculation (GREEN wire)
const float FAN_VOLTAGE_100_SPEED = 1.053;
const float FAN_VOLTAGE_0_SPEED = 2.035;

// Moving average filter (3 readings per pickup)
const int FILTER_SIZE = 3;
float yellowFilter[FILTER_SIZE] = {0};
float greenFilter[FILTER_SIZE] = {0};
float brownFilter[FILTER_SIZE] = {0};
float blackFilter[FILTER_SIZE] = {0};
int filterIndex = 0;

// ============================================
// WiFi & Supabase Configuration
// ============================================
WiFiManager wifiManager;
Preferences preferences;

// HARDCODED Supabase credentials (same for all devices)
const char* SUPABASE_URL = "https://wjyanxstvbiqefmgpccb.supabase.co";
// Supabase credentials should be provisioned per device (do not hardcode secrets in firmware)
const char* SUPABASE_ANON_KEY = "";

// Per-device configuration (entered during setup)
String supabaseUrl = "";
String supabaseAnonKey = "";
String machineUUID = "";
String machineAPIKey = "";  // Separate API key for machine authentication

// WiFi state tracking
bool wifiEnabled = false;
unsigned long wifiOnStartTime = 0;

