Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
// ============================================
// Data Accumulation for Averaging
// ============================================
struct SensorAccumulator {
  float tempMotorSum;
  float tempExteriorSum;
  float tempInteriorSum;
  float ctCurrentSum;
  float ctVoltageSum;
  float apparentPowerSum;
  float yellowVoltageSum;
  float greenVoltageSum;
  float brownVoltageSum;
  float blackVoltageSum;
  int tankFullCount;
  int sampleCount;
  
  // Most recent pickup statuses (not averaged)
  String yellowStatus;
  String greenStatus;
  String brownStatus;
  String blackStatus;
  int fanSpeed;
  
  void reset() {
    tempMotorSum = 0;
    tempExteriorSum = 0;
    tempInteriorSum = 0;
    ctCurrentSum = 0;
    ctVoltageSum = 0;
    apparentPowerSum = 0;
    yellowVoltageSum = 0;
    greenVoltageSum = 0;
    brownVoltageSum = 0;
    blackVoltageSum = 0;
    tankFullCount = 0;
    sampleCount = 0;
  }
  
  void addSample(float tMotor, float tExterior, float tInterior,
                 float ctCurr, float ctVolt, float appPower,
                 float yVolt, float gVolt, float bVolt, float blVolt,
                 bool tankFull, String yStatus, String gStatus, 
                 String bStatus, String blStatus, int fSpeed) {
    tempMotorSum += tMotor;
    tempExteriorSum += tExterior;
    tempInteriorSum += tInterior;
    ctCurrentSum += ctCurr;
    ctVoltageSum += ctVolt;
    apparentPowerSum += appPower;
    yellowVoltageSum += yVolt;
    greenVoltageSum += gVolt;
    brownVoltageSum += bVolt;
    blackVoltageSum += blVolt;
    if(tankFull) tankFullCount++;
    sampleCount++;
    
    // Store most recent statuses
    yellowStatus = yStatus;
    greenStatus = gStatus;
    brownStatus = bStatus;
    blackStatus = blStatus;
    fanSpeed = fSpeed;
  }
} accumulator;

// ============================================
// RTC Memory for Uptime Tracking
// ============================================
RTC_DATA_ATTR unsigned long totalUptimeSeconds = 0;
RTC_DATA_ATTR unsigned long lastResetTime = 0;
RTC_DATA_ATTR bool rtcInitialized = false;

// ============================================
// Timing Variables
// ============================================
unsigned long lastSensorRead = 0;
unsigned long lastDataSend = 0;
unsigned long lastAutoReset = 0;
unsigned long bootTime = 0;
unsigned long bootButtonPressTime = 0;
bool bootButtonPressed = false;
unsigned long lastWatchdogFeed = 0;
unsigned long wifiStuckStartTime = 0;
bool wifiStuckDetected = false;

// ============================================
// Function Prototypes
// ============================================
void launchConfigPortal();
void saveConfigCallback();
void checkBootButton(unsigned long currentMillis);
void checkWiFiStuck(unsigned long currentMillis);
void performAutoReset();

// ============================================
// State Machine
// ============================================
enum SystemState {
  STATE_SENSOR_READING,
  STATE_WIFI_CONNECT,
  STATE_DATA_SEND,
  STATE_WIFI_DISCONNECT
};
SystemState currentState = STATE_SENSOR_READING;

// ============================================
// SETUP
// ============================================
void setup() {
  Serial.begin(115200);
  delay(2000);
  
  Serial.println("\n\n========================================");
  Serial.println("  ESP32 R32 - Cool Breeze Nexus");
  Serial.println("  Firmware: " + FIRMWARE_VERSION);
  Serial.println("========================================");
  Serial.println("Device ID: " + DEVICE_ID);
  
  // Initialize RTC memory tracking
  if(!rtcInitialized) {
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    rtcInitialized = true;
    Serial.println("✓ RTC memory initialized");
  } else {
    Serial.print("✓ Total uptime: ");
    Serial.print(totalUptimeSeconds / 86400);
    Serial.println(" days");
  }
  
  bootTime = millis();
  lastAutoReset = bootTime;
  lastWatchdogFeed = bootTime;
  
  // Initialize boot button (GPIO 0, pulled HIGH, LOW when pressed)
  pinMode(BOOT_BUTTON_PIN, INPUT_PULLUP);
  
  // Boot button will be checked in main loop (5 second hold to enter config mode)
  // Old reset method (hold boot + press reset) has been removed - use boot button hold instead
  
  // Check if 6-month reset is needed
  unsigned long uptimeMillis = totalUptimeSeconds * 1000ULL;
  if(uptimeMillis >= SIX_MONTH_RESET) {
    Serial.println("⚠ 6-month uptime reached - performing full reset...");
    delay(1000);
    
    // Clear all persistent data EXCEPT WiFi credentials
    preferences.begin("iot-nexus", false);
    preferences.clear();
    preferences.end();
    
    // Reset RTC memory
    totalUptimeSeconds = 0;
    lastResetTime = 0;
    
    // Reboot
    ESP.restart();
  }
  
  // Initialize preferences (for Supabase config)
  preferences.begin("iot-nexus", false);
  
  // Load saved configuration
  loadConfiguration();
  
  // Initialize WiFiManager
  initializeWiFiManager();
  
  Serial.println("========================================\n");
  
  // Initialize hardware
  initializeHardware();
  
  // Initialize watchdog timer (60 seconds - improved from 10s)
  // Compatible with both ESP32 core 2.x and 3.x
  // Note: WiFiManager might initialize it, but we'll reinitialize with our settings
  esp_task_wdt_deinit();  // Deinit first to avoid "already initialized" error
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // ESP32 core 3.x - new API with config struct
    esp_task_wdt_config_t twdt_config = {
      .timeout_ms = (uint32_t)WATCHDOG_TIMEOUT * 1000,  // 60 seconds
      .idle_core_mask = 0,  // Monitor all cores (simplified)
      .trigger_panic = true
    };
    esp_task_wdt_init(&twdt_config);
    esp_task_wdt_add(NULL);
  #else
    // ESP32 core 2.x - old API
    esp_task_wdt_init(WATCHDOG_TIMEOUT, true);
    esp_task_wdt_add(NULL);
  #endif
  
  // CRITICAL: Disable WiFi after setup (WiFiManager leaves it on)
  WiFi.mode(WIFI_OFF);
  wifiEnabled = false;
  Serial.println("WiFi disabled - starting sensor reading mode");
  
