Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
  // Initialize state machine - start with sensor reading
  currentState = STATE_SENSOR_READING;
  
  Serial.println("✓ Setup complete. Starting sensor readings...\n");
  Serial.println("OPERATION MODE:");
  Serial.println("  - Sensor readings: Every 1 second (WiFi OFF)");
  Serial.println("  - Data transmission: Every 120 seconds (2 minutes) - OPTIMIZED");
  Serial.println("  - Auto reset: Every 6 hours (improved reliability)");
  Serial.println("  - Full reset: Every 6 months");
  Serial.println("  - Watchdog: 60 seconds (prevents stalls)");
  Serial.println("  - Hold BOOT button for 5 seconds to enter config mode");
  
  #if DEBUG_MODE
    Serial.println("\n⚠ DEBUG MODE ENABLED ⚠");
    Serial.println("  Detailed sensor output every reading");
    Serial.println("  To disable: Set DEBUG_MODE to 0 at top of code");
  #else
    Serial.println("\n✓ Production Mode");
    Serial.println("  Brief status every 10 readings");
  #endif
  
  Serial.println("========================================\n");
  
  // Reset accumulator
  accumulator.reset();
}

// ============================================
// Initialize Hardware
// ============================================
void initializeHardware() {
  Serial.println("Initializing hardware...");
  
  // ADC configuration (compatible with ESP32 Arduino Core 2.x and 3.x)
  analogSetAttenuation(ADC_11db);
  analogSetWidth(12);
  // ADC calibration with proper type casting for Core 3.x compatibility
  esp_adc_cal_characterize(
    ADC_UNIT_1, 
    (adc_atten_t)ADC_ATTEN_DB_11, 
    (adc_bits_width_t)ADC_WIDTH_BIT_12, 
    1100, 
    &adc_chars
  );
  
  // CT sensor
  pinMode(CT_PIN, INPUT);
  emon1.current(CT_PIN, CALIBRATION);
  Serial.println("✓ CT sensor initialized on GPIO 36");
  
  // Temperature sensors
  sensorMotor.begin();
  sensorExterior.begin();
  sensorInterior.begin();
  Serial.println("✓ Temperature sensors initialized (GPIOs 21, 22, 23)");
  
  // Float switch
  pinMode(FLOAT_PIN, INPUT_PULLUP);
  Serial.println("✓ Float switch initialized on GPIO 5");
  
  // Pickup inputs
  pinMode(GPIO_YELLOW_EXHAUST, INPUT);
  pinMode(GPIO_GREEN_FAN, INPUT);
  pinMode(GPIO_BROWN_PUMP, INPUT);
  pinMode(GPIO_BLACK_DRAIN, INPUT);
  Serial.println("✓ Pickup inputs initialized (GPIOs 34, 35, 32, 33)");
}

// ============================================
// MAIN LOOP - State Machine
// ============================================
void loop() {
  unsigned long currentMillis = millis();
  
  // Feed watchdog timer
  if(currentMillis - lastWatchdogFeed >= 1000) {
    esp_task_wdt_reset();
    lastWatchdogFeed = currentMillis;
  }
  
  // Check boot button for config mode entry
  checkBootButton(currentMillis);
  
  // Check for auto reset (6 hours)
  if(currentMillis - lastAutoReset >= AUTO_RESET_INTERVAL) {
    performAutoReset();
  }
  
  // Update RTC uptime counter every second
  static unsigned long lastUptimeUpdate = 0;
  if(currentMillis - lastUptimeUpdate >= 1000) {
    totalUptimeSeconds++;
    lastUptimeUpdate = currentMillis;
  }
  
  // Check for WiFi stuck condition
  checkWiFiStuck(currentMillis);
  
  // CRITICAL: Safety net - force WiFi off if on too long
  checkWiFiTimeout();
  
  // State machine execution
  switch(currentState) {
    case STATE_SENSOR_READING:
      stateSensorReading(currentMillis);
      break;
      
    case STATE_WIFI_CONNECT:
      stateWiFiConnect(currentMillis);
      break;
      
    case STATE_DATA_SEND:
      stateDataSend(currentMillis);
      break;
      
    case STATE_WIFI_DISCONNECT:
      stateWiFiDisconnect(currentMillis);
      break;
  }
  
  delay(10); // Small delay to prevent tight looping
}

// ============================================
// STATE: Sensor Reading (WiFi OFF)
// ============================================
void stateSensorReading(unsigned long currentMillis) {
  // Read sensors every second
  if(currentMillis - lastSensorRead >= SENSOR_READ_INTERVAL) {
    // CRITICAL: Ensure WiFi is OFF before reading
    if(wifiEnabled) {
      Serial.println("⚠ WARNING: WiFi still on during sensor read - disabling...");
      disableWiFi();
    }
    
    // Read all sensors
    float tMotor = readTemperature(sensorMotor);
    float tExterior = readTemperature(sensorExterior);
    float tInterior = readTemperature(sensorInterior);
    
    float ctCurrent, ctVoltage, apparentPower;
    readCTSensor(ctCurrent, ctVoltage, apparentPower);
    
    bool tankFull = (digitalRead(FLOAT_PIN) == LOW);
    
    float yVolt, gVolt, bVolt, blVolt;
    String yStatus, gStatus, bStatus, blStatus;
    int fanSpeed;
    readPickups(yVolt, gVolt, bVolt, blVolt, yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    // Accumulate samples
    accumulator.addSample(tMotor, tExterior, tInterior, ctCurrent, ctVoltage, 
                          apparentPower, yVolt, gVolt, bVolt, blVolt, tankFull,
                          yStatus, gStatus, bStatus, blStatus, fanSpeed);
    
    lastSensorRead = currentMillis;
    
    #if DEBUG_MODE
      // DETAILED DEBUG OUTPUT - Shows all sensor readings
      Serial.println("\n┌─────────────────────────────────────────────────────");
      Serial.print("│ Sample: ");
      Serial.print(accumulator.sampleCount);
      Serial.print("/120  |  Uptime: ");
      Serial.print(millis() / 1000);
      Serial.println(" seconds");
      Serial.println("├─────────────────────────────────────────────────────");
      
      // Temperature Sensors
      Serial.println("│ TEMPERATURE SENSORS:");
      Serial.print("│   Motor:    ");
      Serial.print(tMotor, 2);
      Serial.print(" °C");
      if(tMotor == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Exterior: ");
      Serial.print(tExterior, 2);
      Serial.print(" °C");
      if(tExterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
      Serial.print("│   Interior: ");
      Serial.print(tInterior, 2);
      Serial.print(" °C");
      if(tInterior == -999.0) Serial.print(" ⚠ ERROR!");
      Serial.println();
      
