Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
      // CT Sensor
      Serial.println("│");
      Serial.println("│ CURRENT TRANSFORMER:");
      Serial.print("│   Current:  ");
      Serial.print(ctCurrent, 2);
      Serial.println(" A");
      Serial.print("│   Voltage:  ");
      Serial.print(ctVoltage, 3);
      Serial.println(" V (ADC)");
      Serial.print("│   Power:    ");
      Serial.print(apparentPower, 1);
      Serial.println(" VA");
      
      // Float Switch
      Serial.println("│");
      Serial.println("│ FLOAT SWITCH:");
      Serial.print("│   Tank: ");
      Serial.println(tankFull ? "FULL ✓" : "EMPTY");
      
      // Pickup Inputs
      Serial.println("│");
      Serial.println("│ PICKUP INPUTS:");
      
      // Yellow (Exhaust)
      Serial.print("│   GPIO 34 Yellow: ");
      Serial.print(yVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(yStatus);
      if(yStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Green (Fan + Speed)
      Serial.print("│   GPIO 35 Green:  ");
      Serial.print(gVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(gStatus);
      if(gStatus == "ON") {
        Serial.print("  (Fan Speed: ");
        Serial.print(fanSpeed);
        Serial.print("%)");
      }
      if(gStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Brown (Pump)
      Serial.print("│   GPIO 32 Brown:  ");
      Serial.print(bVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(bStatus);
      if(bStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      // Black (Drain)
      Serial.print("│   GPIO 33 Black:  ");
      Serial.print(blVolt, 3);
      Serial.print(" V  →  ");
      Serial.print(blStatus);
      if(blStatus == "DISCONNECTED") Serial.print(" ⚠");
      Serial.println();
      
      Serial.println("└─────────────────────────────────────────────────────");
      
    #else
      // BRIEF OUTPUT (Production Mode)
      // Print brief status every 10 samples
      if(accumulator.sampleCount % 10 == 0) {
        Serial.print("📊 Samples: ");
        Serial.print(accumulator.sampleCount);
        Serial.print("/120  |  Temp Motor: ");
        Serial.print(tMotor, 1);
        Serial.print("°C  |  CT: ");
        Serial.print(ctCurrent, 2);
        Serial.println("A");
      }
    #endif
  }
  
  // Check if it's time to send data (every 120 seconds - OPTIMIZED)
  if(currentMillis - lastDataSend >= DATA_SEND_INTERVAL) {
    if(accumulator.sampleCount > 0) {
      Serial.println("\n⏱ 120 seconds elapsed - transitioning to WiFi connect...");
      currentState = STATE_WIFI_CONNECT;
    } else {
      Serial.println("⚠ No samples collected - skipping transmission");
      lastDataSend = currentMillis;
    }
  }
}

// ============================================
// STATE: WiFi Connect
// ============================================
void stateWiFiConnect(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  WIFI CONNECT STATE");
  Serial.println("========================================");
  
  enableWiFi();
  
  // Try to connect with timeout
  unsigned long connectStart = millis();
  bool connected = false;
  
  // Try to connect using saved credentials
  Serial.println("Attempting to connect to saved WiFi network...");
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(); // Use saved credentials
  
  int connectAttempts = 0;
  while(millis() - connectStart < WIFI_CONNECT_TIMEOUT) {
    if(WiFi.status() == WL_CONNECTED) {
      connected = true;
      break;
    }
    Serial.print(".");
    delay(500);
    connectAttempts++;
    
    // Feed watchdog during connection attempt
    if(connectAttempts % 4 == 0) {  // Every 2 seconds
      esp_task_wdt_reset();
    }
    
    // Check if we're stuck (shouldn't happen with timeout, but safety check)
    if(millis() - connectStart > WIFI_CONNECT_TIMEOUT) {
      Serial.println("\n⚠️ WiFi connection timeout exceeded!");
      break;
    }
  }
  
  Serial.println();
  
  if(connected) {
    Serial.println("✓ WiFi connected!");
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("  RSSI: ");
    Serial.print(WiFi.RSSI());
    Serial.println(" dBm");
    
    // Sync time with NTP
    configTime(0, 0, "pool.ntp.org");
    
    wifiStuckDetected = false;  // Reset stuck detection
    currentState = STATE_DATA_SEND;
  } else {
    Serial.println("✗ WiFi connection failed (timeout)");
    Serial.println("  Discarding accumulated data to prevent overflow");
    Serial.println("  (Hold BOOT button for 5 seconds to enter config mode if WiFi changed)");
    
    // CRITICAL: Discard data during long outages
    // IMPORTANT: Don't start config portal automatically - WiFi might just be temporarily down
    // User can manually enter config mode via boot button if needed
    accumulator.reset();
    lastDataSend = millis();
    
    currentState = STATE_WIFI_DISCONNECT;
  }
}

// ============================================
// STATE: Data Send
// ============================================
void stateDataSend(unsigned long currentMillis) {
  Serial.println("\n========================================");
  Serial.println("  DATA SEND STATE");
  Serial.println("========================================");
  
  // Check if Supabase is configured
  if(supabaseUrl.length() == 0 || machineUUID.length() == 0 || machineAPIKey.length() == 0) {
    Serial.println("⚠ Machine not fully configured - skipping transmission");
    Serial.println("  Missing:");
    if(supabaseUrl.length() == 0) Serial.println("    - Supabase URL");
    if(machineUUID.length() == 0) Serial.println("    - Machine UUID");
    if(machineAPIKey.length() == 0) Serial.println("    - Machine API Key");
    Serial.println("  Hold BOOT button for 5 seconds to enter config mode");
    accumulator.reset();
    lastDataSend = millis();
    currentState = STATE_WIFI_DISCONNECT;
    return;
  }
  
  // Calculate averages
  float avgTempMotor = accumulator.tempMotorSum / accumulator.sampleCount;
  float avgTempExterior = accumulator.tempExteriorSum / accumulator.sampleCount;
  float avgTempInterior = accumulator.tempInteriorSum / accumulator.sampleCount;
  float avgCtCurrent = accumulator.ctCurrentSum / accumulator.sampleCount;
  float avgCtVoltage = accumulator.ctVoltageSum / accumulator.sampleCount;
  float avgApparentPower = accumulator.apparentPowerSum / accumulator.sampleCount;
  float avgYellowVoltage = accumulator.yellowVoltageSum / accumulator.sampleCount;
  float avgGreenVoltage = accumulator.greenVoltageSum / accumulator.sampleCount;
  float avgBrownVoltage = accumulator.brownVoltageSum / accumulator.sampleCount;
  float avgBlackVoltage = accumulator.blackVoltageSum / accumulator.sampleCount;
  bool tankFullAvg = (accumulator.tankFullCount > (accumulator.sampleCount / 2));
  
  // Print averaged data
  Serial.println("\nAveraged Data (from " + String(accumulator.sampleCount) + " samples):");
  Serial.println("  Temp Motor:    " + String(avgTempMotor, 2) + " °C");
  Serial.println("  Temp Exterior: " + String(avgTempExterior, 2) + " °C");
  Serial.println("  Temp Interior: " + String(avgTempInterior, 2) + " °C");
  Serial.println("  CT Current:    " + String(avgCtCurrent, 2) + " A");
  Serial.println("  Tank:          " + String(tankFullAvg ? "FULL" : "EMPTY"));
  
  // Build JSON payload
  bool success = sendToSupabase(
    avgTempMotor, avgTempExterior, avgTempInterior,
    avgCtCurrent, avgCtVoltage, avgApparentPower,
    avgYellowVoltage, avgGreenVoltage, avgBrownVoltage, avgBlackVoltage,
    tankFullAvg,
    accumulator.yellowStatus, accumulator.greenStatus,
    accumulator.brownStatus, accumulator.blackStatus,
    accumulator.fanSpeed
  );
  
  if(success) {
    Serial.println("✓ Data sent successfully!");
  } else {
    Serial.println("✗ Data send failed");
  }
  
