Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
// ============================================
// Send Data to Supabase (DASHBOARD COMPATIBLE)
// ============================================
bool sendToSupabase(float tMotor, float tExterior, float tInterior,
                    float ctCurrent, float ctVoltage, float appPower,
                    float yVolt, float gVolt, float bVolt, float blVolt,
                    bool tankFull,
                    String yStatus, String gStatus, String bStatus, String blStatus,
                    int fanSpeed) {
  
  if(WiFi.status() != WL_CONNECTED) {
    return false;
  }
  
  HTTPClient http;
  WiFiClientSecure client;
  
  // Skip certificate validation (for development - Supabase uses valid certificates)
  // In production, you could add the root CA certificate here for better security
  client.setInsecure();
  
  // Set client timeout to prevent hanging
  client.setTimeout(HTTP_POST_TIMEOUT / 1000);  // Convert to seconds
  http.setTimeout(HTTP_POST_TIMEOUT);
  http.setConnectTimeout(5000);  // 5 second connection timeout
  
  // Direct to Edge Function endpoint (secure - validates machine API key)
  String endpoint = supabaseUrl + "/functions/v1/esp32-data-receiver";
  
  // Build JSON payload - RAW SENSOR DATA ONLY
  StaticJsonDocument<768> doc;
  
  // ========================================
  // RAW SENSOR READINGS
  // ========================================
  doc["machine_id"] = machineUUID;
  
  // Temperatures (°C)
  doc["motor_temp"] = tMotor;           // Temp 1
  doc["outside_temp"] = tExterior;      // Temp 2
  doc["inside_temp"] = tInterior;       // Temp 3
  
  // Current & Power
  doc["current"] = ctCurrent;           // Amps
  doc["voltage"] = LINE_VOLTAGE;        // 230V constant
  doc["power"] = appPower;              // Watts (V × I)
  
  // Tank Status
  doc["has_water"] = tankFull;          // Water full/empty (bool)
  
  // ========================================
  // RAW PICKUP VOLTAGES (for server-side logic)
  // ========================================
  doc["exhaust_voltage"] = yVolt;       // Voltage 1 (Yellow wire)
  doc["fan_voltage"] = gVolt;           // Voltage 2 (Green wire)
  doc["pump_voltage"] = bVolt;          // Voltage 3 (Brown wire)
  doc["drain_voltage"] = blVolt;        // Voltage 4 (Black wire)
  
  // Sensor read count (number of readings averaged)
  doc["sensor_read_count"] = accumulator.sampleCount;
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  #if DEBUG_MODE
    Serial.println("\nPOST to Supabase (RAW DATA):");
    Serial.println("  URL: " + endpoint);
    Serial.println("  Machine ID: " + machineUUID);
    Serial.print("  Temps: Motor=");
    Serial.print(tMotor);
    Serial.print("°C, Out=");
    Serial.print(tExterior);
    Serial.print("°C, In=");
    Serial.print(tInterior);
    Serial.println("°C");
    Serial.print("  Current: ");
    Serial.print(ctCurrent);
    Serial.println(" A");
    Serial.println("  Full Payload: " + jsonString);
  #endif
  
  // Send HTTP POST to Edge Function (validates machine API key)
  // Feed watchdog before potentially long operation
  esp_task_wdt_reset();
  
  unsigned long postStart = millis();
  http.begin(client, endpoint);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseAnonKey);  // Still needed for Supabase routing
  http.addHeader("Authorization", "Bearer " + machineAPIKey);  // Use machine's key
  
  int httpCode = http.POST(jsonString);
  unsigned long postDuration = millis() - postStart;
  
  // Feed watchdog after operation
  esp_task_wdt_reset();
  
  bool success = false;
  
  if(httpCode == 201 || httpCode == 200) {
    success = true;
    #if DEBUG_MODE
      Serial.print("  HTTP Code: ");
      Serial.print(httpCode);
      Serial.print("  (took ");
      Serial.print(postDuration / 1000.0, 1);
      Serial.println(" seconds)");
      Serial.println("  ✓ Success!");
    #endif
  } else {
    #if DEBUG_MODE
      Serial.print("  HTTP Code: ");
      Serial.print(httpCode);
      Serial.print("  (took ");
      Serial.print(postDuration / 1000.0, 1);
      Serial.println(" seconds)");
      Serial.println("  ✗ Error:");
      Serial.println("  " + http.getString());
    #endif
  }
  
  http.end();
  
  return success;
}

// ============================================
// Initialize WiFiManager
// ============================================
void initializeWiFiManager() {
  wifiManager.setConfigPortalTimeout(180); // 3 minutes
  wifiManager.setAPStaticIPConfig(IPAddress(192,168,4,1), IPAddress(192,168,4,1), IPAddress(255,255,255,0));
  wifiManager.setSaveConfigCallback(saveConfigCallback);
  
  // Load hardcoded Supabase credentials (same for all devices)
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  
  // Custom parameters ONLY for machine-specific info
  // (Supabase URL and Anon Key are hardcoded - same for all devices!)
  WiFiManagerParameter customMachineUUID("machine_uuid", "Machine UUID (from Dashboard)", machineUUID.c_str(), 40);
  WiFiManagerParameter customMachineAPIKey("api_key", "Machine API Key (from Dashboard)", machineAPIKey.c_str(), 100);
  
  wifiManager.addParameter(&customMachineUUID);
  wifiManager.addParameter(&customMachineAPIKey);
  
  Serial.println("\n========================================");
  Serial.println("WiFi Configuration:");
  Serial.println("========================================");
  
  // Try to connect - ONLY start config portal if NO credentials exist
  // If credentials exist but WiFi is down, don't start portal (WiFi might be temporarily down)
  String savedSSID = WiFi.SSID();
  if(savedSSID.length() == 0) {
    // No saved credentials - start config portal
    Serial.println("No WiFi credentials found - starting config portal...");
    Serial.println("Connect to WiFi network: 'ESP32_HVAC_Setup'");
    Serial.println("Navigate to: 192.168.4.1");
    if(!wifiManager.autoConnect("ESP32_HVAC_Setup")) {
      Serial.println("Config portal timed out - will retry on next boot");
      // Don't restart - let device continue (will try again later)
    }
  } else {
    // Credentials exist - try to connect but don't start portal on failure
    Serial.println("WiFi credentials found - attempting connection...");
    WiFi.mode(WIFI_STA);
    WiFi.begin();
    
    unsigned long connectStart = millis();
    while(WiFi.status() != WL_CONNECTED && (millis() - connectStart < 10000)) {
      delay(500);
      Serial.print(".");
    }
    
    if(WiFi.status() == WL_CONNECTED) {
      Serial.println("\nWiFi connected!");
    } else {
      Serial.println("\nWiFi connection failed - will retry later");
      Serial.println("(Hold BOOT button for 5 seconds to enter config mode)");
      // Don't start config portal - WiFi might just be temporarily down
      // User can manually enter config mode via boot button if needed
    }
  }
  
  // Save configuration (only machine-specific, Supabase credentials are hardcoded)
  machineUUID = String(customMachineUUID.getValue());
  machineAPIKey = String(customMachineAPIKey.getValue());
  
  saveConfiguration();
  
  Serial.println("✓ Using hardcoded Supabase credentials");
  Serial.println("  Supabase URL: " + supabaseUrl);
  Serial.println("  Machine UUID: " + machineUUID);
  if(machineAPIKey.length() > 0) {
    Serial.println("  API Key: Configured ✓");
  }
}

