Josiah-crown/cool-breeze-nexus/hardware/esp32/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug/ESP32_HVAC_CoolBreezeNexus_V2_Optimized_debug.ino
// ============================================
// Load Configuration
// ============================================
void loadConfiguration() {
  // Load hardcoded Supabase credentials (same for all devices)
  supabaseUrl = String(SUPABASE_URL);
  supabaseAnonKey = String(SUPABASE_ANON_KEY);
  
  // Load machine-specific configuration
  machineUUID = preferences.getString("machine_uuid", machineUUID.c_str());
  machineAPIKey = preferences.getString("api_key", machineAPIKey.c_str());
}

// ============================================
// Save Configuration
// ============================================
void saveConfiguration() {
  // Save ONLY machine-specific config (Supabase credentials are hardcoded)
  preferences.putString("machine_uuid", machineUUID);
  preferences.putString("api_key", machineAPIKey);
}

// ============================================
// Launch WiFiManager Config Portal (for boot button)
// ============================================
void launchConfigPortal() {
  #if DEBUG_MODE
    Serial.println("\n========================================");
    Serial.println("  CONFIGURATION PORTAL");
    Serial.println("========================================");
    Serial.println("Starting WiFiManager config portal...");
    Serial.println("Connect to WiFi network: 'ESP32_HVAC_Setup'");
    Serial.println("Navigate to: 192.168.4.1");
    Serial.println("========================================\n");
  #endif
  
  // Start config portal (will timeout after 3 minutes)
  wifiManager.startConfigPortal("ESP32_HVAC_Setup");
  
  // After config is saved
  if(WiFi.status() == WL_CONNECTED) {
    #if DEBUG_MODE
      Serial.println("✓ WiFi configured and connected!");
    #endif
  }
}

// ============================================
// WiFiManager Save Config Callback
// ============================================
void saveConfigCallback() {
  Serial.println("\n✓ Config saved by WiFiManager");
  // Note: Actual parameter retrieval and saving happens in initializeWiFiManager()
}

// ============================================
// Check Boot Button (5 second hold to enter config)
// ============================================
void checkBootButton(unsigned long currentMillis) {
  bool buttonState = digitalRead(BOOT_BUTTON_PIN) == LOW;  // LOW when pressed
  
  if(buttonState && !bootButtonPressed) {
    // Button just pressed
    bootButtonPressTime = currentMillis;
    bootButtonPressed = true;
  } else if(buttonState && bootButtonPressed) {
    // Button still held
    unsigned long holdTime = currentMillis - bootButtonPressTime;
    if(holdTime >= BOOT_BUTTON_HOLD_TIME) {
      // Button held for 5 seconds - enter config mode
      #if DEBUG_MODE
        Serial.println("\n============================================");
        Serial.println("BOOT BUTTON HELD - Entering WiFi Config Mode");
        Serial.println("============================================");
        Serial.println("Clearing WiFi settings...");
      #endif
      
      // Clear WiFi credentials
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      
      // Clear preferences
      preferences.begin("iot-nexus", false);
      preferences.clear();
      preferences.end();
      
      // Clear WiFiManager settings
      wifiManager.resetSettings();
      
      #if DEBUG_MODE
        Serial.println("WiFi settings cleared. Restarting...");
      #endif
      delay(2000);
      ESP.restart();
    }
  } else if(!buttonState && bootButtonPressed) {
    // Button released
    bootButtonPressed = false;
  }
}

// ============================================
// Check for WiFi Stuck Condition
// ============================================
void checkWiFiStuck(unsigned long currentMillis) {
  // Detect if WiFi has been trying to connect for too long
  if(wifiEnabled && WiFi.status() != WL_CONNECTED) {
    if(!wifiStuckDetected) {
      wifiStuckStartTime = currentMillis;
      wifiStuckDetected = true;
    } else {
      // WiFi stuck trying to connect
      if(currentMillis - wifiStuckStartTime > WIFI_STUCK_TIMEOUT) {
        delay(1000);
        ESP.restart();
      }
    }
  } else {
    wifiStuckDetected = false;
  }
}

// ============================================
// Perform Auto Reset (Soft Reset - 6 hours)
// ============================================
void performAutoReset() {
  #if DEBUG_MODE
    Serial.println("\n========================================");
    Serial.println("  AUTO RESET (6 HOURS ELAPSED)");
    Serial.println("========================================");
    Serial.println("Performing soft reset to clear RAM...");
  #endif
  
  delay(1000);
  ESP.restart();
}


